In [1]:
3+4

7

In [2]:
"santosh"*2

'santoshsantosh'

# Comparison Operators

In [3]:
3==3

True

# Logical Operators

In [4]:
#and -> Returns the first false value; if not found returns the last
#OR  -> Retruns the first true value; if not found returns last

In [8]:
0 and 3

0

In [14]:
3 and 0

0

In [17]:
3 and 5

5

In [19]:
3 or 0

3

In [22]:
0 or 3

3

In [24]:
x=2
if(x%2==0):
    print("Even")
else:
    print("Not an even")

Even

In [27]:
y=98

if(y>98):
    print("Grade A")
elif(y>40):
    print("Grade B")
else:
    print("Print c")

Grade B

# Looping

In [29]:
#range(a,b) --> a =11, b=50

# loop starts at 11 and ends at (b-1) 49
for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

In [31]:
# loop starts at 10 and ends at (b-1) 48; coz b-1 is 49, but we are looping till 49; 49+2= 51; which is wrong; so 48
for i in range(10,50,2):
    print(i)

10
12
14
16
18
20
22
24
26
28
30
32
34
36
38
40
42
44
46
48

In [33]:
for i in range(1,100,2):
    print(i)

1
3
5
7
9
11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49
51
53
55
57
59
61
63
65
67
69
71
73
75
77
79
81
83
85
87
89
91
93
95
97
99

In [36]:
for i in range(1,101,2):
    print(i)

1
3
5
7
9
11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49
51
53
55
57
59
61
63
65
67
69
71
73
75
77
79
81
83
85
87
89
91
93
95
97
99

# Functions

In [2]:
def compare(a,b):
    if(a>b):
        greater=a
    else:
        greater=b
    return greater

In [5]:
compare(10,2)

10

# Lists

In [20]:
mars = [1,2,32,1,332,32,362,43]

In [21]:
mars[0:4]

[1, 2, 32, 1]

In [23]:
# add an element
mars.append(72)

In [25]:
mars.append([99,69])

In [27]:
mars

[1, 2, 32, 1, 332, 32, 362, 43, 72, [99, 69]]

In [29]:
#delete an element using Value

mars.remove(1)

In [31]:
mars

[2, 32, 332, 32, 362, 43, 72, [99, 69]]

In [32]:
del mars[2]

In [34]:
mars

[2, 32, 32, 362, 43, 72, [99, 69]]

In [36]:
for mark in mars:
    print(mark)

2
32
32
362
43
72
[99, 69]

# Dictionary

In [2]:
marks = {'history':52,"science":63,"social":99}

In [5]:
marks['history']

52

In [9]:
#Adding one element to dictionary
marks['biology']=36

#Adding more then one element to dictionary
marks.update({'math':85,'DS':86})

In [16]:
marks

{'science': 63, 'social': 99, 'biology': 36, 'math': 85, 'DS': 86}

In [17]:
del marks['social']

In [19]:
marks

{'science': 63, 'biology': 36, 'math': 85, 'DS': 86}

# Pandas: Read File

In [21]:
import pandas as pd

In [23]:
df = pd.read_csv("data.csv")

In [25]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
df1 = pd.read_excel("data.xlsx")

In [28]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S